Tekla Open API Reference for Tekla Structures 2025
CustomPartPositioningTypeAttribute Constructor
Overload List
Name | Description
CustomPartPositioningTypeAttribute(Int32)
 The custom attribute uses this to store the positioning type to the system. This is not to be used by itself.
CustomPartPositioningTypeAttribute(CustomPartBase.CustomPartPositioningType)
 The custom attribute uses this to store the positioning type to the system. This is not to be used by itself.
Top
See Also
Reference
CustomPartPositioningTypeAttribute Class
Tekla.Structures.Plugins Namespace